In [3]:
import pandas as pd

df1 = pd.read_csv('Lista-Hopin-051021.csv', delimiter=";")
df1.columns

Index(['Email', 'First Name', 'Last Name', 'Ticket Group', 'Ticket Type',
       'Price Paid', 'Promo Code', 'Registration Date', 'Registration Time',
       'Registration Status', 'Attendance Status', 'Role'],
      dtype='object')

In [4]:
df2 = pd.read_csv('Lista-ECOS-051021.csv', delimiter=";")
df2.columns

Index(['Nome', 'Nome para Crachá', 'Email'], dtype='object')

In [5]:
m = pd.merge(df1, df2, how = 'outer', on = 'Email', suffixes=['', '_'], indicator=True)

In [6]:
m.columns

Index(['Email', 'First Name', 'Last Name', 'Ticket Group', 'Ticket Type',
       'Price Paid', 'Promo Code', 'Registration Date', 'Registration Time',
       'Registration Status', 'Attendance Status', 'Role', 'Nome',
       'Nome para Crachá', '_merge'],
      dtype='object')

In [7]:
m.drop(columns=['Ticket Group', 'Ticket Type',
       'Price Paid', 'Promo Code', 'Registration Date', 'Registration Time',
       'Registration Status', 'Attendance Status', 'Role', 'Nome',
       'Nome para Crachá', ])

                       Email   First Name          Last Name      _merge
0         alisson@univali.br      alisson           steffens   left_only
1    emerson_ml@yahoo.com.br      Emerson                 ML   left_only
2    hector.kobayashi@usp.br       Hector  Kobayashi Yassuda   left_only
3        gabiruryo@gmail.com  Gabriel Ryo              Hioki   left_only
4     laneyear8519@gmail.com     Wisllane              Sousa        both
..                       ...          ...                ...         ...
307    rafaella.nunes@usp.br          NaN                NaN  right_only
308     roberto@eller.eti.br          NaN                NaN  right_only
309    suellenf249@gmail.com          NaN                NaN  right_only
310     Taticris05@gmail.com          NaN                NaN  right_only
311    wendymendys@gmail.com          NaN                NaN  right_only

[312 rows x 4 columns]

In [8]:
m['_merge'] = m['_merge'].map({'left_only':'hopin',
                             'right_only':'Ecos',
                             'both':'ambos'},
                             na_action=None)

In [9]:
n = m.drop(columns=['Ticket Group', 'Ticket Type',
       'Price Paid', 'Promo Code', 'Registration Date', 'Registration Time',
       'Registration Status', 'Attendance Status', 'Role', 'Nome',
       'Nome para Crachá', ])

In [10]:
n

                       Email   First Name          Last Name _merge
0         alisson@univali.br      alisson           steffens  hopin
1    emerson_ml@yahoo.com.br      Emerson                 ML  hopin
2    hector.kobayashi@usp.br       Hector  Kobayashi Yassuda  hopin
3        gabiruryo@gmail.com  Gabriel Ryo              Hioki  hopin
4     laneyear8519@gmail.com     Wisllane              Sousa  ambos
..                       ...          ...                ...    ...
307    rafaella.nunes@usp.br          NaN                NaN   Ecos
308     roberto@eller.eti.br          NaN                NaN   Ecos
309    suellenf249@gmail.com          NaN                NaN   Ecos
310     Taticris05@gmail.com          NaN                NaN   Ecos
311    wendymendys@gmail.com          NaN                NaN   Ecos

[312 rows x 4 columns]

In [ ]:
n.to_csv('comparacao.csv', index=False, header=False)

In [11]:
n.sort_values(by=['_merge'], inplace=True)

In [12]:
n.to_csv('comparacao.csv', index=False, header=False)